<script setup>
</script>

<template>
    <div class="description flex" id="description">
        <img src="@assets/imgs/description.png" alt="">
        <div class="description__container">
            <div class="description__item">
                <h2>Комфорт и безопасность от HIMO</h2>
                <p>Электровелосипед HIMO C26 позволит вам быстро и с комфортом добраться до места работы или учебы и не привязываться к городскому транспорту. Велосипед обладает прочной конструкцией и внушительным запасом хода, чтобы стать надежным транспортным средством в современных городских условиях. Легкая и прочная рама, 26-дюймовые колеса и 7-ступенчатая система трансмиссии позволяют уверенно передвигаться не только по асфальтированному дорожному полотну, но и по сложной загородной трассе.</p>
            </div>
            <div class="description__item">
                <h2>Прочная и легкая рама</h2>
                <p>Рама HIMO C26 изготовлена из прочного и легкого алюминиевого сплава и отличается высокой надежностью, устойчивостью в аварийных ситуациях, превосходной управляемостью и комфортным передвижением по любой дороге.</p>
            </div>
            <div class="description__item">
                <h2>Комбинация режимов для увеличения запаса хода</h2>
                <p>Электровелосипед HIMO C26 обладает увеличенным запасом хода. Его аккумулятор емкостью 10000 мАч с интеллектуальной системой оптимизации энергопотребления позволяет проехать до 60 км на одном заряде в режиме электропривода. При использовании на некоторых участках пути физической силы дальность хода увеличивается до 100 км. Максимальная скорость передвижения HIMO C26 составляет 25 км/ч.</p>
            </div>
            <div class="description__item">
                <h2>Надежная трансмиссия</h2>
                <p>7-ступенчатая система трансмиссии обеспечивает плавное и точное переключение передач, удобное управление скоростью и надежность в работе. Переключая передачи, вы сможете с минимальными усилиями заехать на горку и безопасно скатиться вниз.</p>
            </div>
            <div class="description__item">
                <h2>Вся информация на ЖК-дисплее</h2>
                <p>Вся информация на ЖК-дисплее
                    Большой информативный дисплей, вынесенный на рулевую стойку, отображает всю важную информацию о работе HIMO C26 в реальном времени. Вы сможете узнать актуальную скорость передвижения, уровень заряда или пройденный путь. Дисплей защищен от воздействия внешних факторов по стандарту IPX7 и не боится дождя и пыли.</p>
            </div>
            <div class="description__item">
                <h2>Удобное седло</h2>
                <p>Электровелосипед HIMO C26 укомплектован велосипедным седлом от известного бренда Selle Royal. Трехмерная гелевая структура седла обеспечивает оптимальную упругость и высокий комфорт во время езды.</p>
            </div>
        </div> <!-- description__container -->
    </div> <!-- description -->
</template>

<style scoped>
    .description {
        margin-top: 150px;
        width: 100%;
    }

    .description img {
        max-width: 570px;
    }

    .description__container {
        max-width: 450px;
    }

    .description__item {
        margin-top: 50px;
    }

    .description__item:first-child {
        margin-top: 0;
    }

    .description__item p {
        margin-top: 10px;
    }

    /* media ---------------- */
    /* <= 1024px */
    @media (max-width: 1024px) {
        .description img {
            max-width: 450px;
        }

        .description__item {
            margin-top: 20px;
        }
    }

    /* <= 850px */
    @media (max-width: 850px) {
        .description {
            flex-direction: column;
        }

        .description__container {
            margin-top: 30px;
        }
    }

    /* <= 520px */
    @media (max-width: 520px) {

        .description {
            max-width: 400px;
            margin: 50px auto 0;
        }

    }
</style>